// pages/intro/intro.ts
Page({

  /**
   * 组件的属性列表
   */
  properties: {

  },

  /**
   * 组件的初始数据
   */
  data: {
      para1:"孤独症，又称自闭症，是一类起病于3岁以前，以社交交往障碍、沟通障碍和局限性，刻板性、重复行为为主要特征的心理发育障碍，是广泛性发育障碍中最有代表性的疾病之一。对于孤独症，主要分类包括隔离型孤独症、被动性孤独症 和 主动与特异型孤独症。",

      para2:"隔离型孤独症儿童通常表现为对环境的封闭，缺乏人际交往能力，口语表达能力差，缺乏共享性能力，对刺激有敏感反应等特征。被动性孤独症儿童在社交和交流方面比隔离型稍好，但仍表现为被动、重复的沟通和行为。主动与特异型孤独症儿童的症状较轻，表现为在一定程度上可以与人接触，但仍存在沟通和理解能力的困难。",

      para3:"孤独症的发病原因复杂多样，早期发育问题、遗传因素以及脑部异常都可能是其原因之一。儿童在言语、社交、兴趣与行为、感知觉、运动和智力方面可能存在问题。语言发育迟缓、社交困难、兴趣狭窄、重复行为、感官敏感、运动异常和智力缺陷等是常见的表现。",

      para4:"对于孤独症患者及其家庭而言，早期识别和干预显得尤为重要。个性化的治疗方案和全面的支持计划有助于帮助孩子。并且，社会的理解和支持也至关重要，尊重和包容是孤独症患者走向社会融合的基石。通过持续的科学研究和关注，我们可以更深入地了解孤独症助和支持。关爱孤独症群体，需要家长、机构、社会三方共同形成合力，才能更好帮助他们克服困难。"
  },

  /**
   * 组件的方法列表
   */
  methods: {

  }
})